In [1]:
# 游늷 Importamos las librer칤as necesarias
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import re

# 游늷 Ruta del archivo CSV
ruta = r"C:\Users\Usuario\Desktop\CSV A LIMPIAR\officials.csv"

# 游늷 Cargamos el CSV
df_inactive = pd.read_csv(ruta)

# 游늷 Mostramos estructura general del DataFrame
df_inactive.info()
df_inactive.head()
df_inactive.shape

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70971 entries, 0 to 70970
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   game_id      70971 non-null  int64
 1   official_id  70971 non-null  int64
 2   first_name   70971 non-null  object
 3   last_name    70971 non-null  object
 4   jersey_num   70781 non-null  float64
dtypes: float64(1), int64(2), object(2)
memory usage: 2.7+ MB

(70971, 5)

In [2]:
# 游늷 Mostrar cantidad de valores nulos por columna
nulos = df_inactive.isnull().sum()
nulos = nulos[nulos > 0].sort_values(ascending=False)

print("游늵 Valores nulos por columna:")
print(nulos)

游늵 Valores nulos por columna:
jersey_num    190
dtype: int64

In [3]:
# 游늷 Mostrar filas que contienen al menos un valor nulo
filas_con_nulos = df_inactive[df_inactive.isnull().any(axis=1)]

# 游늷 Ver las primeras filas con nulos
filas_con_nulos.head()

       game_id  official_id first_name  last_name  jersey_num
3688  40300101         1192    Bennett  Salvatore         NaN
3689  40300101         1168      David      Jones         NaN
3690  40300101         1162      Scott     Foster         NaN
3694  40300151         1164        Ron  Garretson         NaN
3695  40300151         1167      Steve      Javie         NaN

In [5]:
# 游늷 Verificar filas con valores duplicados en la columna 'official_id'
duplicados_id = df_inactive[df_inactive.duplicated(subset='official_id', keep=False)]

# 游늷 Mostrar cu치ntas filas est치n duplicadas por id
print(f"游대 Filas con ID duplicado: {len(duplicados_id)}")

# 游늷 Mostrar las filas duplicadas
duplicados_id.head()

游대 Filas con ID duplicado: 70938

    game_id  official_id first_name  last_name  jersey_num
0  29600059         1140      Bruce  Alexander         9.0
1  29600059         1165       Luis     Grillo         8.0
2  29600059         1153        Joe   Crawford        17.0
3  29600114         1147       Mike   Callahan        24.0
4  29600114         1142       Dick    Bavetta        27.0